Repository: Lalad/ginc
Catalog: app/Locale/*/LC_MESSAGES/messages.po
Languages: de, el, es, fr

source: Demonstration
el: Επίδειξης
es: Demostración
fr: Démonstration

source: If you change your browser language setting to a different first language you can then view this page in different languages.
de: Wenn Sie Ihren Browser Spracheinstellung zu einer anderen Erstsprache ändern können Sie dann diese Seite in verschiedenen Sprachen.
el: Εάν αλλάξετε τη γλώσσα ρύθμιση του προγράμματός σας σε μια διαφορετική πρώτη γλώσσα μπορείτε να δείτε στη συνέχεια αυτή τη σελίδα σε διάφορες γλώσσες.
es: Si cambia el idioma configuración para que una lengua materna diferente a continuación, puede ver esta página en diferentes idiomas.
fr: Si vous modifiez la langue de votre navigateur pour une langue différente de la première peut alors afficher cette page dans différentes langues.

source: Spanish, French and German translations are provided.
de: Spanisch, Französisch und Deutsch Übersetzungen werden zur Verfügung gestellt.
el: Παρέχονται ισπανική, γαλλική και γερμανική μετάφραση.
es: traducciones al español, francés y alemán se proporcionan.
fr: traductions en espagnol, français et allemand sont fournis.

source: Try adding a new gettext language translation.
de: Versuchen Sie, eine neue Sprache gettext Übersetzung.
el: Δοκιμάστε να προσθέσετε μια νέα μετάφραση γλώσσα gettext.
es: Trate de añadir una traducción gettext nuevo idioma.
fr: Essayez d'ajouter une traduction gettext nouvelle langue.

source: In Firefox go to
de: In Firefox gehen
el: Στο Firefox πηγαίνετε στο
es: En Firefox ir a
fr: Dans Firefox, allez à

source: Edit
de: Bearbeiten
el: Επεξεργασία
es: Editar
fr: Modifier

source: Preferences
de: Voreinstellungen
el: Προτιμήσεις
es: Preferencias
fr: Préférences

source: Content
de: Inhalt
el: Περιεχόμενο
es: Contenido
fr: Contenu

source: Languages
de: Sprachen
el: Γλώσσες
es: Idiomas
fr: Langues

source: In IE go to
de: Im IE gehen
el: Σε IE πηγαίνετε στο
es: En Internet Explorer vaya a
fr: Dans IE aller à

source: Tools
de: Werkzeuge
el: Εργαλεία
es: Herramientas
fr: Outils

source: Internet Options
de: Internet-Optionen
el: Επιλογές Internet
es: Opciones de Internet
fr: Options Internet

source: General
de: Allgemeine
el: Γενικά
fr: Général

source: If you look at the php source file you will see that we are using gettext to translate both single words and full sentences.
de: Wenn Sie auf der PHP-Quelldatei schauen, werden Sie sehen, dass wir mit gettext sowohl einzelne Wörter und ganze Sätze übersetzen.
el: Αν κοιτάξετε το αρχείο προέλευσης php θα δείτε ότι χρησιμοποιούμε gettext να μεταφράσουν τόσο μεμονωμένες λέξεις και ολόκληρες προτάσεις.
es: Si nos fijamos en el archivo de código fuente PHP podrás ver que estamos usando gettext para traducir dos palabras y frases completas.
fr: Si vous regardez le code source PHP, vous verrez que nous utilisons gettext pour traduire ces deux mots simples et des phrases complètes.

source: In Main App
de: Im Main App
el: Σε Κύρια App
es: En la aplicación principal
fr: Dans cette appli principale

source: Now using the Main App translation file.
de: Jetzt mit dem Main App Übersetzung Datei.
el: Τώρα, χρησιμοποιώντας το κύριο αρχείο μετάφρασης App.
es: Ahora, utilizando el archivo principal de la aplicación de traducción.
fr: Maintenant, en utilisant le fichier de traduction principal de cette appli.

source: Back in Main App
de: Zurück in der Main App
el: Επιστροφή στην Κύρια App
es: De vuelta en la aplicación principal
fr: Retour dans l'App Main

source: Do some more Main App stuff.
de: Tun Sie etwas mehr Main App Zeug.
el: Κάνετε κάποια περισσότερα πράγματα Κύρια App.
es: Haga un poco de más cosas de la aplicación principal.
fr: Faites-en plus des principales appli choses.

source: Once again using the Main App translation file.
de: Wieder einmal mit dem Main App Übersetzung Datei.
el: Πάλι χρησιμοποιώντας το κύριο αρχείο μετάφρασης App.
es: Una vez más utilizando el archivo principal de la aplicación de traducción.
fr: Une fois de plus l'aide du fichier principal de traduction de cette appli.

source: Steps to Create New Gettext Translation
de: Schritte zum New Gettext Übersetzung erstellen
el: Βήματα για την Δημιουργία Νέου μεταφράσεων
es: Pasos para Crear Nueva Traducción Gettext
fr: Étapes pour créer la traduction Gettext Nouveau

source: 1. Create a new locale language directory:
de: 1. Erstellen Sie eine neue Sprache locale Verzeichnis:
el: 1. Δημιουργήστε ένα νέο κατάλογο γλώσσα locale:
es: 1. Crear un directorio de configuración regional de idioma nuevo:
fr: 1. Créer un répertoire locale nouveau langage:

source: 2. Run xgettext like this:
de: 2. Run xgettext wie folgt aus:
el: 2. Εκτελέστε xgettext όπως αυτό:
es: 2. Ejecutar xgettext así:
fr: 2. xgettext Run comme ceci:

source: 3. Set charset and add your new translations in:
de: 3. Charset Set und fügen Sie Ihre neue Übersetzungen in:
el: 3. Ορισμός charset και να προσθέσετε νέες μεταφράσεις σας:
es: 3. charset Establecer y añadir sus nuevas traducciones en:
fr: 3. charset Set et ajoutez vos nouvelles traductions en:

source: 4. Run msgfmt like this:
de: 4. Run msgfmt wie folgt aus:
el: 4. Εκτελέστε msgfmt όπως αυτό:
es: 4. Ejecutar msgfmt así:
fr: 4. msgfmt Run comme ceci:

source: That's it.
de: Das war's.
el: Έτσι μπράβο.
es: Eso es todo.
fr: C'est tout.

source: Now restart your test webserver to prevent any caching issues and enjoy your new translation.
de: Nun starten Sie den Test Webserver keine Caching-Probleme zu verhindern und genießen Sie Ihre neue Übersetzung.
el: Τώρα, κάντε επανεκκίνηση του διακομιστή δοκιμής σας να αποφευχθεί οποιαδήποτε θέματα προσωρινής αποθήκευσης και να απολαύσετε νέα μετάφραση σας.
es: Ahora reinicie el servidor web de prueba para evitar cualquier problema de almacenamiento en caché y disfrutar de su nueva traducción.
fr: Maintenant, redémarrez votre serveur de test pour éviter tous les problèmes de mise en cache et de profiter de votre nouvelle traduction.
